-- 3-5-3: 【SQLの実行】で使用したテーブルのレコードを削除
DELETE FROM tb_shohin;

INSERT INTO tb_shohin (shohin_id, shohin_name, tanka) 
VALUES  ('001', 'いちご', 500), 
        ('002', 'ぶどう', 900),
        ('003', 'バナナ', 700),
        ('004', 'アボカド', 400),
        ('005', 'サクランボ', 1200),
        ('006', '梨', 1100),
        ('007', 'レモン', 500),
        ('008', 'すだち', 700),
        ('009', 'マスカット', 2000),
        ('010', 'オレンジ', 1100),
        ('011', '柿', 800),
        ('012', 'りんご', 1400),
        ('013', 'スイカ', 1800),
        ('014', 'メロン', 1900),
        ('015', 'アセロラ', 1300),
        ('016', 'イチジク', 100),
        ('017', 'キウイフルーツ', 300),
        ('018', 'グレープフルーツ', 200),
        ('019', 'ドリアン', 3300),
        ('020', 'パイナップル', 800),
        ('021', 'マンゴー', 1900),
        ('022', 'ライチ', 600);