/**
 * Task2_1: 課題内容
 *
 * 本課題では、データ型・文字列の使い方を学んでいきましょう。
 * 問①から問⑧まであります。
 * 指定された型・値・変数名を守って記述してください。
 *
 */
public class Task2_1 {

    public static void main(String[] args) {

        // ①int型の hogeInt という名前の変数を宣言し、値「50」で初期化して下さい。

        // ②変数 hogeInt を値「100」で上書きして下さい。

        // ③Stringクラスの hogeString という名前の変数を宣言し、値「テスト」で初期化して下さい。

        // ④変数 hogeString を値「合格」で上書きして下さい。

        // ⑤下記の処理について、何をしているのかコメントを記入して下さい。
        // [コメントをここへ記述]
        double hogeDouble = 0.2;

        // ⑥変数 hogeInt の値を表示させて下さい。

        // ⑦下記の処理について、何をしているのかコメントを記入して下さい。
        // [コメントをここへ記述]
        System.out.println(hogeString);

        // ⑧変数 hogeDouble の値を表示させて下さい。

    }
}
/* コンソール出力結果↓

100
合格
0.2

 */